
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/scarlet0725/ig-caption-crawler/actions/runs/5598271475)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/fc3c0217-1213-43c2-a7e2-6cf80a98c859/terraform-bin apply -auto-approve
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_artifact_registry_repository.icc will be created
  + resource "google_artifact_registry_repository" "icc" {
      + create_time   = (known after apply)
      + description   = "instagram caption crawler"
      + format        = "DOCKER"
      + id            = (known after apply)
      + location      = "asia-northeast1"
      + mode          = "STANDARD_REPOSITORY"
      + name          = (known after apply)
      + project       = (known after apply)
      + repository_id = "icc"
      + update_time   = (known after apply)
    }

  # google_storage_bucket.icc will be created
  + resource "google_storage_bucket" "icc" {
      + force_destroy               = true
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "ig-caption-crawler"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
google_artifact_registry_repository.icc: Creating...
google_storage_bucket.icc: Creating...
google_storage_bucket.icc: Creation complete after 2s [id=ig-caption-crawler]
google_artifact_registry_repository.icc: Creation complete after 3s [id=projects/prism-prod-372103/locations/asia-northeast1/repositories/icc]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # google_artifact_registry_repository.icc will be created%0A  + resource "google_artifact_registry_repository" "icc" {%0A      + create_time   = (known after apply)%0A      + description   = "instagram caption crawler"%0A      + format        = "DOCKER"%0A      + id            = (known after apply)%0A      + location      = "asia-northeast1"%0A      + mode          = "STANDARD_REPOSITORY"%0A      + name          = (known after apply)%0A      + project       = (known after apply)%0A      + repository_id = "icc"%0A      + update_time   = (known after apply)%0A    }%0A%0A  # google_storage_bucket.icc will be created%0A  + resource "google_storage_bucket" "icc" {%0A      + force_destroy               = true%0A      + id                          = (known after apply)%0A      + labels                      = (known after apply)%0A      + location                    = "ASIA-NORTHEAST1"%0A      + name                        = "ig-caption-crawler"%0A      + project                     = (known after apply)%0A      + public_access_prevention    = (known after apply)%0A      + self_link                   = (known after apply)%0A      + storage_class               = "STANDARD"%0A      + uniform_bucket_level_access = (known after apply)%0A      + url                         = (known after apply)%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0Agoogle_artifact_registry_repository.icc: Creating...%0Agoogle_storage_bucket.icc: Creating...%0Agoogle_storage_bucket.icc: Creation complete after 2s [id=ig-caption-crawler]%0Agoogle_artifact_registry_repository.icc: Creation complete after 3s [id=projects/prism-prod-372103/locations/asia-northeast1/repositories/icc]%0AReleasing state lock. This may take a few moments...%0A%0AApply complete! Resources: 2 added, 0 changed, 0 destroyed.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform_apply","PRNumber":1,"Program":"tfcmt","SHA1":"96d6e34c1fae7716412177d506b10da44b6e5e41","Vars":{},"WorkflowName":"terraform apply"} -->